app/controllers/words_controller.rb

  def anagram
    # Reduce subset of words searched by word size
    wordsubset = Word.find_all_by_wordsize(params[:id].size)
---
SELECT "words".* FROM "words" WHERE "words"."wordsize" = 4 LIMIT 1

  def create
    params[:words].each do |word|
      dbword = Word.new(:word => word)
      dbword.save
---
INSERT INTO "words" ("created_at", "updated_at", "word", "wordsize") VALUES (?, ?, ?, ?)  [["created_at", Mon, 05 Sep 2016 01:31:03 UTC +00:00], ["updated_at", Mon, 05 Sep 2016 01:31:03 UTC +00:00], ["word", "read"], ["wordsize", 4]]

  def destroy
    delword = Word.find_by_word(params[:id])
    delword.destroy
---
SELECT "words".* FROM "words" WHERE "words"."word" = 'dear' LIMIT 1
DELETE FROM "words" WHERE "words"."id" = ?  [["id", 3]]

  def destroy_all
    allwords = Word.all
    allwords.each do |word|
      word.destroy
---
SELECT "words".* FROM "words"
DELETE FROM "words" WHERE "words"."id" = ?  [["id", 2]]